notes/meeting_2022jun05.org
* meeting notes June 05, 2022
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022may22.md
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/2022may22

*** topics
**** continuing adventures with move/copy/rename
**** recent weekly challenges that weren't number theory trivia for once
***** Task 1: Hexadecimal Words; Task 2: K-Directory Diff
****** https://theweeklychallenge.org/blog/perl-weekly-challenge-166/
****** arne sommers
******* https://raku-musings.com/hexa-diff.html
***** Task 1: Scalable Vector Graphics (SVG); Task 2: Line of Best Fit
****** https://theweeklychallenge.org/blog/perl-weekly-challenge-165/
****** arne sommers
******* https://raku-musings.com/doubly-scalable.html

** announcements 
*** June 19th: next raku study group meeting (just a few days before...)
*** June 21-25: tprc: perl/raku conference 
**** 4 hours of Bruce Gray: talk + 3hr tutorial
***** https://tprc2022.sched.com/event/ylEK/command-line-filters-time-to-shine
***** https://tprc2022.sched.com/overview/type/Raku+Track











