notes/meeting_2022jun05.md
- [meeting notes June 05, 2022](#orgd90d9a8)
  - [the raku study group](#org493a068)
    - [topics](#orga5adb01)
  - [announcements](#orgf5f3b98)
    - [June 19th: next raku study group meeting (just a few days before&#x2026;)](#orgbcb9acf)
    - [June 21-25: tprc: perl/raku conference](#org147d452)


<a id="orgd90d9a8"></a>

# meeting notes June 05, 2022


<a id="org493a068"></a>

## the raku study group

1.  usual links

    1.  these notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022may22.md>
    
    2.  code examples
    
        1.  <https://github.com/doomvox/raku-study/tree/main/bin/2022may22>


<a id="orga5adb01"></a>

### topics

1.  continuing adventures with move/copy/rename

2.  recent weekly challenges that weren't number theory trivia for once

    1.  Task 1: Hexadecimal Words; Task 2: K-Directory Diff
    
        1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-166/>
        
        2.  arne sommers
        
            1.  <https://raku-musings.com/hexa-diff.html>
    
    2.  Task 1: Scalable Vector Graphics (SVG); Task 2: Line of Best Fit
    
        1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-165/>
        
        2.  arne sommers
        
            1.  <https://raku-musings.com/doubly-scalable.html>


<a id="orgf5f3b98"></a>

## announcements


<a id="orgbcb9acf"></a>

### June 19th: next raku study group meeting (just a few days before&#x2026;)


<a id="org147d452"></a>

### June 21-25: tprc: perl/raku conference

1.  4 hours of Bruce Gray: talk + 3hr tutorial

    1.  <https://tprc2022.sched.com/event/ylEK/command-line-filters-time-to-shine>
    
    2.  <https://tprc2022.sched.com/overview/type/Raku+Track>
